diplom/src/Documents/ВКМ_НачислениеЗаработнойПлаты/ВКМ_НачислениеЗаработнойПлаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_НачислениеЗаработнойПлаты</name>
  <comment>Дипломная работа Володин А.А.</comment>
  <registerRecords>CalculationRegister.ВКМ_ОсновныеНачисления</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_УчетОтпусков</registerRecords>
  <registerRecords>CalculationRegister.ВКМ_ДополнительныеНачисления</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВзаиморасчетыССотрудниками</registerRecords>
  <registerRecords>CalculationRegister.ВКМ_Удержания</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Начисления</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидРасчета</name>
      <type>
        <types>ChartOfCalculationTypesRef.ВКМ_ДополнительныеНачисления</types>
        <types>ChartOfCalculationTypesRef.ВКМ_ОсновныеНачисления</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Размер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГрафикРаботы</name>
      <type>
        <types>CatalogRef.ВКМ_ГрафикиРаботы</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

diplom/src/CalculationRegisters/ВКМ_ОсновныеНачисления/ВКМ_ОсновныеНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>ВКМ_ОсновныеНачисления</name>
  <comment>Дипломная работа Володин А.А.</comment>
  <periodicity>Month</periodicity>
  <actionPeriod>true</actionPeriod>
  <basePeriod>true</basePeriod>
  <schedule>InformationRegister.ВКМ_ГрафикиРаботы</schedule>
  <scheduleValue>InformationRegister.ВКМ_ГрафикиРаботы.Resource.Значение</scheduleValue>
  <scheduleDate>InformationRegister.ВКМ_ГрафикиРаботы.Dimension.Дата</scheduleDate>
  <chartOfCalculationTypes>ChartOfCalculationTypes.ВКМ_ОсновныеНачисления</chartOfCalculationTypes>
  <resources>
    <name>Результат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЧасовОтработано</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КалендарныеДни</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.ВКМ_ГрафикиРаботы</types>
    </type>
  </attributes>
  <attributes>
    <name>Показатель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:CalculationRegister>

diplom/src/CalculationRegisters/ВКМ_ДополнительныеНачисления/ВКМ_ДополнительныеНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>ВКМ_ДополнительныеНачисления</name>
  <comment>Дипломная работа Володин А.А.</comment>
  <periodicity>Month</periodicity>
  <chartOfCalculationTypes>ChartOfCalculationTypes.ВКМ_ДополнительныеНачисления</chartOfCalculationTypes>
  <resources>
    <name>Результат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ПроцентПремии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:CalculationRegister>

diplom/src/CalculationRegisters/ВКМ_Удержания/ВКМ_Удержания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>ВКМ_Удержания</name>
  <comment>Дипломная работа Володин А.А.</comment>
  <periodicity>Month</periodicity>
  <chartOfCalculationTypes>ChartOfCalculationTypes.ВКМ_Удержания</chartOfCalculationTypes>
  <resources>
    <name>Результат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:CalculationRegister>

diplom/src/Documents/ВКМ_НачислениеЗаработнойПлаты/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
    
    СформироватьДвижения();
    
    РассчитатьОклад();
    
    РассчитатьОтпуск();
    
    РассчитатьНДФЛ();
    
    РассчитатьЗарплатуКВыплате();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СформироватьДвижения()
    
    
    
	// регистр ВКМ_ОсновныеНачисления

	Для Каждого ТекСтрокаНачисления из Начисления Цикл
		
    		Движение = Движения.ВКМ_ОсновныеНачисления.Добавить();
    		Движение.Сторно = Ложь;
    		Движение.ВидРасчета = ТекСтрокаНачисления.ВидРасчета;
    		Движение.ПериодРегистрации = Дата;
    		Движение.ПериодДействияНачало = ТекСтрокаНачисления.ДатаОкончания;
    		Движение.ПериодДействияКонец = ТекСтрокаНачисления.ДатаОкончания;
    		Движение.Сотрудник = ТекСтрокаНачисления.Сотрудник;
    		Движение.Категория = ТекСтрокаНачисления.Категория;
    		Движение.Результат = ТекСтрокаНачисления.Размер;
		
	КонецЦикла;
	
	Движения.ВКМ_ОсновныеНачисления.Записать();
    
    //{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
    //Данный фрагмент построен конструктором.
    //При повторном использовании конструктора, внесенные вручную данные будут утеряны!
	
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
    
КонецПроцедуры

Процедура РассчитатьОклад()
    
    
КонецПроцедуры

Процедура РассчитатьОтпуск()
    
    
КонецПроцедуры

Процедура РассчитатьНДФЛ()
    
    Запрос = Новый Запрос;
    Запрос.Текст =
        "ВЫБРАТЬ
        |    ВКМ_ОсновныеНачисления.Сотрудник КАК Сотрудник,
        |    СУММА(ВКМ_ОсновныеНачисления.Результат) КАК Результат
        |ИЗ
        |    РегистрРасчета.ВКМ_ОсновныеНачисления КАК ВКМ_ОсновныеНачисления
        |ГДЕ
        |    ВКМ_ОсновныеНачисления.Регистратор.Ссылка = &Ссылка
        |СГРУППИРОВАТЬ ПО
        |    ВКМ_ОсновныеНачисления.Сотрудник
        |
        |ОБЪЕДИНИТЬ ВСЕ
        |
        |ВЫБРАТЬ
        |    ВКМ_ДополнительныеНачисления.Сотрудник,
        |    СУММА(ВКМ_ДополнительныеНачисления.Результат)
        |ИЗ
        |    РегистрРасчета.ВКМ_ДополнительныеНачисления КАК ВКМ_ДополнительныеНачисления
        |ГДЕ
        |    ВКМ_ДополнительныеНачисления.Регистратор.Ссылка = &Ссылка
        |СГРУППИРОВАТЬ ПО
        |    ВКМ_ДополнительныеНачисления.Сотрудник";
        
    Запрос.УстановитьПараметр("Ссылка", Ссылка);
        
    РезультатЗапроса = Запрос.Выполнить();
        
    Выборка = РезультатЗапроса.Выбрать();
        
    Пока Выборка.Следующий() Цикл
            
        Движение = Движения.ВКМ_Удержания.Добавить();
        Движение.ПериодРегистрации = Дата;
        Движение.Сотрудник = Выборка.Сотрудник;
        Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.НДФЛ;
        Движение.Результат = Выборка.Результат * 0.87;
                    
    КонецЦикла;
    
    Движения.ВКМ_Удержания.Записать();
    
КонецПроцедуры

Процедура РассчитатьЗарплатуКВыплате()
    
    Запрос = Новый Запрос;
    Запрос.Текст =
        "ВЫБРАТЬ
        |    ВКМ_ОсновныеНачисления.Сотрудник,
        |    ЕСТЬNULL(ВКМ_ОсновныеНачисления.Результат, 0) КАК Результат
        |ПОМЕСТИТЬ ВТ_Начисления
        |ИЗ
        |    РегистрРасчета.ВКМ_ОсновныеНачисления КАК ВКМ_ОсновныеНачисления
        |ГДЕ
        |    ВКМ_ОсновныеНачисления.Регистратор = &Ссылка
        |
        |ОБЪЕДИНИТЬ ВСЕ
        |
        |ВЫБРАТЬ
        |    ВКМ_ДополнительныеНачисления.Сотрудник,
        |    ЕСТЬNULL(ВКМ_ДополнительныеНачисления.Результат, 0)
        |ИЗ
        |    РегистрРасчета.ВКМ_ДополнительныеНачисления КАК ВКМ_ДополнительныеНачисления
        |ГДЕ
        |    ВКМ_ДополнительныеНачисления.Регистратор = &Ссылка
        |;
        |
        |////////////////////////////////////////////////////////////////////////////////
        |ВЫБРАТЬ
        |    ВТ_Начисления.Сотрудник КАК Сотрудник,
        |    СУММА(ВТ_Начисления.Результат) КАК Результат
        |ПОМЕСТИТЬ ВТ_Группировка
        |ИЗ
        |    ВТ_Начисления КАК ВТ_Начисления
        |СГРУППИРОВАТЬ ПО
        |    ВТ_Начисления.Сотрудник
        |;
        |
        |////////////////////////////////////////////////////////////////////////////////
        |ВЫБРАТЬ
        |    ВТ_Группировка.Сотрудник,
        |    ВТ_Группировка.Результат,
        |    СУММА(ВКМ_Удержания.Результат) КАК НДФЛ
        |ИЗ
        |    ВТ_Группировка КАК ВТ_Группировка
        |        ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_Удержания КАК ВКМ_Удержания
        |        ПО ВТ_Группировка.Сотрудник = ВКМ_Удержания.Сотрудник
        |ГДЕ
        |    ВКМ_Удержания.Регистратор = &Ссылка
        |СГРУППИРОВАТЬ ПО
        |    ВТ_Группировка.Сотрудник,
        |    ВТ_Группировка.Результат";
        
    Запрос.УстановитьПараметр("Ссылка", Ссылка);
      
    РезультатЗапроса = Запрос.Выполнить();
        
    Выборка = РезультатЗапроса.Выбрать();
        
    Пока Выборка.Следующий() Цикл
        
        //Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
        
    КонецЦикла;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
